Tekla Open API Reference for Tekla Structures 2025
View.CreateFrontView Method
 Generates a new front view on the sheet of the given active drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateFrontView(
	Drawing drawing,
	Point viewInsertionPoint,
	View.ViewAttributes viewAttributes,
	out View view
)
Public Shared Function CreateFrontView (
	drawing As Drawing,
	viewInsertionPoint As Point,
	viewAttributes As View.ViewAttributes,
	<OutAttribute> ByRef view As View
) As Boolean
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
The active drawing in which to create the view.
viewInsertionPoint
Type: Tekla.Structures.Geometry3d.Point
The center point of the view.
viewAttributes
Type: Tekla.Structures.Drawing.View.ViewAttributes
The attributes for the view to be created.
view
Type: Tekla.Structures.Drawing.View
 The created view is returned if the creation was successful. Otherwise, null is returned.
Return Value
Type: Boolean
True if the view was created successfully.
Exceptions
Exception | Condition
InvalidTypeException | Thrown if given drawing is GA drawing.
TeklaStructuresDrawingsApplicationException | Thrown if an unknown error occurrs.
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace